/* eslint-disable */
import * as VTable from '../../src';
import VChart from '@visactor/vchart';
import { bindDebugTool } from '../../src/scenegraph/debug-tool';

const CONTAINER_ID = 'vTable';
VTable.register.chartModule('vchart', VChart);
export function createTable() {
  const option = {
    widthMode: 'adaptive',
    heightMode: 'adaptive',
    columnTree: [
      {
        dimensionKey: ' ',
        value: ''
      }
    ],
    rowTree: [
      {
        dimensionKey: '230810115400021',
        value: '办公用品'
      },
      {
        dimensionKey: '230810115400021',
        value: '家具'
      },
      {
        dimensionKey: '230810115400021',
        value: '技术'
      }
    ],
    columns: [],
    rows: [
      {
        dimensionKey: '230810115400021',
        dimensionTitle: '类别'
      }
    ],
    indicators: [
      {
        indicatorKey: '0',
        width: 'auto',
        caption: 'caption',
        columnType: 'chart',
        chartModule: 'vchart',
        chartSpec: {
          type: 'common',
          axes: [
            {
              id: 'main-0',
              type: 'linear',
              tick: {
                visible: false,
                style: {
                  stroke: '#f5222d'
                }
              },
              niceType: 'accurateFirst',
              grid: {
                visible: false,
                style: {
                  stroke: '#f5222d',
                  lineWidth: 5,
                  lineDash: [5, 5]
                }
              },
              orient: 'left',
              visible: true,
              domainLine: {
                visible: true,
                style: {
                  lineWidth: 1,
                  stroke: '#f5222d'
                }
              },
              title: {
                visible: true,
                text: '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
                style: {
                  fontSize: 10,
                  fill: '#f5222d',
                  fontWeight: 'normal'
                }
              },
              label: {
                visible: true,
                style: {
                  fontSize: 14,
                  fill: '#f5222d',
                  angle: 0,
                  fontWeight: 'normal'
                }
              },
              hover: false,
              background: {
                visible: true,
                state: {
                  hover: {
                    fillOpacity: 0.08,
                    fill: '#141414'
                  }
                }
              },
              zero: true,
              sync: {
                axisId: 'sub-0',
                zeroAlign: true,
                tickAlign: true
              }
            },
            {
              id: 'sub-0',
              type: 'linear',
              tick: {
                visible: false,
                style: {
                  stroke: '#f5222d'
                }
              },
              niceType: 'accurateFirst',
              grid: {
                visible: false,
                style: {
                  stroke: '#f5222d',
                  lineWidth: 5,
                  lineDash: [5, 5]
                }
              },
              orient: 'right',
              visible: true,
              domainLine: {
                visible: true,
                style: {
                  lineWidth: 1,
                  stroke: '#f5222d'
                }
              },
              title: {
                visible: true,
                text: '利润',
                style: {
                  fontSize: 10,
                  fill: '#f5222d',
                  fontWeight: 'normal'
                }
              },
              label: {
                visible: true,
                style: {
                  fontSize: 14,
                  fill: '#f5222d',
                  angle: 0,
                  fontWeight: 'normal'
                }
              },
              hover: false,
              background: {
                visible: true,
                state: {
                  hover: {
                    fillOpacity: 0.08,
                    fill: '#141414'
                  }
                }
              },
              zero: true,
              sync: {
                axisId: 'main-0',
                zeroAlign: true,
                tickAlign: true
              }
            }
          ],
          zeroAlign: true,
          series: [
            {
              type: 'bar',
              yField: '010011',
              xField: ['230804193430032'],
              stack: false,
              direction: 'vertical',
              data: {
                sortIndex: 0,
                id: 'main-data',
                fields: {
                  '10001': {
                    alias: '指标名称 '
                  },
                  '20001': {
                    alias: '图例项 ',
                    domain: ['超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额', '利润'],
                    lockStatisticsByDomain: true
                  },
                  '010011': {
                    alias: '指标值(主轴) '
                  },
                  '010012': {
                    alias: '指标值(次轴) '
                  },
                  '230804193430032': {
                    alias: '地区',
                    sortIndex: 0
                  },
                  '230808211907009': {
                    alias: '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额'
                  },
                  '230810114507017': {
                    alias: '利润'
                  },
                  '230810115400021': {
                    alias: '类别'
                  }
                }
              },
              seriesField: '20001'
            },
            {
              type: 'line',
              yField: '010012',
              xField: ['230804193430032'],
              label: {
                visible: true,
                overlap: {
                  hideOnHit: true,
                  clampForce: true
                },
                style: {
                  fontSize: 12,
                  fontWeight: 'normal',
                  fill: '#363839',
                  stroke: 'rgba(255, 255, 255, 0.8)',
                  lineWidth: 2,
                  strokeOpacity: 1
                },
                position: 'outside',
                smartInvert: false
              },
              stack: false,
              direction: 'vertical',
              data: {
                sortIndex: 0,
                id: 'sub-data',
                fields: {
                  '10001': {
                    alias: '指标名称 '
                  },
                  '20001': {
                    alias: '图例项 ',
                    domain: ['超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额', '利润'],
                    lockStatisticsByDomain: true
                  },
                  '010011': {
                    alias: '指标值(主轴) '
                  },
                  '010012': {
                    alias: '指标值(次轴) '
                  },
                  '230804193430032': {
                    alias: '地区',
                    sortIndex: 0
                  },
                  '230808211907009': {
                    alias: '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额'
                  },
                  '230810114507017': {
                    alias: '利润'
                  },
                  '230810115400021': {
                    alias: '类别'
                  }
                }
              },
              seriesField: '20001'
            }
          ],
          color: {
            type: 'ordinal',
            range: ['#2E62F1', '#4DC36A'],
            domain: ['超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额', '利润']
          },
          tooltip: {
            visible: false
          }
        }
      }
    ],
    indicatorsAsCol: false,
    records: {
      '0': [
        {
          '10001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '10003': '230808211907009',
          '20001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '010011': '347692.57691955566',
          '230804193430032': '西南',
          '230808211907009': '347692.57691955566',
          '230810115400021': '办公用品'
        },
        {
          '10001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '10003': '230808211907009',
          '20001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '010011': '1270911.2654294968',
          '230804193430032': '中南',
          '230808211907009': '1270911.2654294968',
          '230810115400021': '办公用品'
        },
        {
          '10001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '10003': '230808211907009',
          '20001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '010011': '824673.0542612076',
          '230804193430032': '东北',
          '230808211907009': '824673.0542612076',
          '230810115400021': '办公用品'
        },
        {
          '10001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '10003': '230808211907009',
          '20001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '010011': '745813.5155878067',
          '230804193430032': '华北',
          '230808211907009': '745813.5155878067',
          '230810115400021': '办公用品'
        },
        {
          '10001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '10003': '230808211907009',
          '20001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '010011': '267870.7928543091',
          '230804193430032': '西北',
          '230808211907009': '267870.7928543091',
          '230810115400021': '办公用品'
        },
        {
          '10001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '10003': '230808211907009',
          '20001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '010011': '1408628.5947360992',
          '230804193430032': '华东',
          '230808211907009': '1408628.5947360992',
          '230810115400021': '办公用品'
        },
        {
          '10001': '利润',
          '10003': '230810114507017',
          '20001': '利润',
          '010012': '49272.21633812785',
          '230804193430032': '西南',
          '230810114507017': '49272.21633812785',
          '230810115400021': '办公用品'
        },
        {
          '10001': '利润',
          '10003': '230810114507017',
          '20001': '利润',
          '010012': '219815.48459594697',
          '230804193430032': '中南',
          '230810114507017': '219815.48459594697',
          '230810115400021': '办公用品'
        },
        {
          '10001': '利润',
          '10003': '230810114507017',
          '20001': '利润',
          '010012': '86067.63242470473',
          '230804193430032': '东北',
          '230810114507017': '86067.63242470473',
          '230810115400021': '办公用品'
        },
        {
          '10001': '利润',
          '10003': '230810114507017',
          '20001': '利润',
          '010012': '137265.85579952598',
          '230804193430032': '华北',
          '230810114507017': '137265.85579952598',
          '230810115400021': '办公用品'
        },
        {
          '10001': '利润',
          '10003': '230810114507017',
          '20001': '利润',
          '010012': '49633.47177379578',
          '230804193430032': '西北',
          '230810114507017': '49633.47177379578',
          '230810115400021': '办公用品'
        },
        {
          '10001': '利润',
          '10003': '230810114507017',
          '20001': '利润',
          '010012': '215585.69271230698',
          '230804193430032': '华东',
          '230810114507017': '215585.69271230698',
          '230810115400021': '办公用品'
        },
        {
          '10001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '10003': '230808211907009',
          '20001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '010011': '316212.42824935913',
          '230804193430032': '西北',
          '230808211907009': '316212.42824935913',
          '230810115400021': '家具'
        },
        {
          '10001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '10003': '230808211907009',
          '20001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '010011': '919743.9351348877',
          '230804193430032': '华北',
          '230808211907009': '919743.9351348877',
          '230810115400021': '家具'
        },
        {
          '10001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '10003': '230808211907009',
          '20001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '010011': '1676224.1276245117',
          '230804193430032': '华东',
          '230808211907009': '1676224.1276245117',
          '230810115400021': '家具'
        },
        {
          '10001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '10003': '230808211907009',
          '20001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '010011': '920698.4041175842',
          '230804193430032': '东北',
          '230808211907009': '920698.4041175842',
          '230810115400021': '家具'
        },
        {
          '10001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '10003': '230808211907009',
          '20001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '010011': '501533.7320175171',
          '230804193430032': '西南',
          '230808211907009': '501533.7320175171',
          '230810115400021': '家具'
        },
        {
          '10001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '10003': '230808211907009',
          '20001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '010011': '1399928.2008514404',
          '230804193430032': '中南',
          '230808211907009': '1399928.2008514404',
          '230810115400021': '家具'
        },
        {
          '10001': '利润',
          '10003': '230810114507017',
          '20001': '利润',
          '010012': '24903.787846319377',
          '230804193430032': '西北',
          '230810114507017': '24903.787846319377',
          '230810115400021': '家具'
        },
        {
          '10001': '利润',
          '10003': '230810114507017',
          '20001': '利润',
          '010012': '148800.47773075104',
          '230804193430032': '华北',
          '230810114507017': '148800.47773075104',
          '230810115400021': '家具'
        },
        {
          '10001': '利润',
          '10003': '230810114507017',
          '20001': '利润',
          '010012': '163453.42999391258',
          '230804193430032': '华东',
          '230810114507017': '163453.42999391258',
          '230810115400021': '家具'
        },
        {
          '10001': '利润',
          '10003': '230810114507017',
          '20001': '利润',
          '010012': '72692.64069590718',
          '230804193430032': '东北',
          '230810114507017': '72692.64069590718',
          '230810115400021': '家具'
        },
        {
          '10001': '利润',
          '10003': '230810114507017',
          '20001': '利润',
          '010012': '29303.0919713974',
          '230804193430032': '西南',
          '230810114507017': '29303.0919713974',
          '230810115400021': '家具'
        },
        {
          '10001': '利润',
          '10003': '230810114507017',
          '20001': '利润',
          '010012': '199582.20107278973',
          '230804193430032': '中南',
          '230810114507017': '199582.20107278973',
          '230810115400021': '家具'
        },
        {
          '10001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '10003': '230808211907009',
          '20001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '010011': '936196.0161590576',
          '230804193430032': '东北',
          '230808211907009': '936196.0161590576',
          '230810115400021': '技术'
        },
        {
          '10001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '10003': '230808211907009',
          '20001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '010011': '230956.3768310547',
          '230804193430032': '西北',
          '230808211907009': '230956.3768310547',
          '230810115400021': '技术'
        },
        {
          '10001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '10003': '230808211907009',
          '20001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '010011': '1466575.628829956',
          '230804193430032': '中南',
          '230808211907009': '1466575.628829956',
          '230810115400021': '技术'
        },
        {
          '10001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '10003': '230808211907009',
          '20001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '010011': '453898.2000274658',
          '230804193430032': '西南',
          '230808211907009': '453898.2000274658',
          '230810115400021': '技术'
        },
        {
          '10001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '10003': '230808211907009',
          '20001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '010011': '781743.5634155273',
          '230804193430032': '华北',
          '230808211907009': '781743.5634155273',
          '230810115400021': '技术'
        },
        {
          '10001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '10003': '230808211907009',
          '20001': '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          '010011': '1599653.7198867798',
          '230804193430032': '华东',
          '230808211907009': '1599653.7198867798',
          '230810115400021': '技术'
        },
        {
          '10001': '利润',
          '10003': '230810114507017',
          '20001': '利润',
          '010012': '83431.23610076308',
          '230804193430032': '东北',
          '230810114507017': '83431.23610076308',
          '230810115400021': '技术'
        },
        {
          '10001': '利润',
          '10003': '230810114507017',
          '20001': '利润',
          '010012': '24016.215898036957',
          '230804193430032': '西北',
          '230810114507017': '24016.215898036957',
          '230810115400021': '技术'
        },
        {
          '10001': '利润',
          '10003': '230810114507017',
          '20001': '利润',
          '010012': '251487.62814944983',
          '230804193430032': '中南',
          '230810114507017': '251487.62814944983',
          '230810115400021': '技术'
        },
        {
          '10001': '利润',
          '10003': '230810114507017',
          '20001': '利润',
          '010012': '19061.419725894928',
          '230804193430032': '西南',
          '230810114507017': '19061.419725894928',
          '230810115400021': '技术'
        },
        {
          '10001': '利润',
          '10003': '230810114507017',
          '20001': '利润',
          '010012': '144986.8839621544',
          '230804193430032': '华北',
          '230810114507017': '144986.8839621544',
          '230810115400021': '技术'
        },
        {
          '10001': '利润',
          '10003': '230810114507017',
          '20001': '利润',
          '010012': '228179.5603364408',
          '230804193430032': '华东',
          '230810114507017': '228179.5603364408',
          '230810115400021': '技术'
        }
      ]
    },
    defaultHeaderRowHeight: 18,
    indicatorTitle: ' ',
    corner: {
      titleOnDimension: 'row'
    },
    autoWrapText: true,
    theme: {
      bodyStyle: {
        borderColor: 'rgba(0,4,20,0.2)',
        borderLineWidth: [1, 0, 0, 1],
        padding: 1
      },
      headerStyle: {
        borderColor: 'rgba(0,4,20,0.2)',
        fontSize: 12,
        color: '#333333',
        textAlign: 'center',
        borderLineWidth: [0, 0, 1, 1],
        hover: {
          cellBgColor: 'rgba(20, 20, 20, 0.08)'
        }
      },
      rowHeaderStyle: {
        borderColor: 'rgba(0,4,20,0.2)',
        fontSize: 12,
        color: '#333333',
        borderLineWidth: [1, 1, 0, 0],
        hover: {
          cellBgColor: 'rgba(20, 20, 20, 0.08)'
        }
      },
      cornerHeaderStyle: {
        borderColor: 'rgba(0,4,20,0.2)',
        textAlign: 'center',
        fontSize: 12,
        color: '#333333',
        fontWeight: 'bold',
        borderLineWidth: [0, 1, 1, 0],
        hover: {
          cellBgColor: ''
        }
      },
      cornerRightTopCellStyle: {
        borderColor: 'rgba(0,4,20,0.2)',
        borderLineWidth: [0, 0, 1, 1],
        hover: {
          cellBgColor: ''
        }
      },
      cornerLeftBottomCellStyle: {
        borderColor: 'rgba(0,4,20,0.2)',
        borderLineWidth: [1, 1, 0, 0],
        hover: {
          cellBgColor: ''
        }
      },
      cornerRightBottomCellStyle: {
        borderColor: 'rgba(0,4,20,0.2)',
        borderLineWidth: [1, 0, 0, 1],
        hover: {
          cellBgColor: ''
        }
      },
      rightFrozenStyle: {
        borderColor: 'rgba(0,4,20,0.2)',
        borderLineWidth: [1, 0, 1, 1]
      },
      bottomFrozenStyle: {
        borderColor: 'rgba(0,4,20,0.2)',
        borderLineWidth: [1, 1, 0, 1]
      },
      selectionStyle: {
        cellBgColor: '',
        cellBorderColor: ''
      },
      frameStyle: {
        borderLineWidth: 0
      }
    },
    legends: {
      id: 'legend',
      orient: 'top',
      position: 'middle',
      layoutType: 'normal',
      visible: true,
      hover: false,
      maxRow: 1,
      title: {
        textStyle: {
          fontSize: 12,
          fill: '#6F6F6F'
        }
      },
      item: {
        spaceRow: 0,
        spaceCol: 0,
        padding: {
          top: 4,
          bottom: 4,
          left: 4,
          right: 22
        },
        background: {
          style: {
            fillOpacity: 0.001
          }
        },
        label: {
          style: {
            fontSize: 12,
            fill: '#6F6F6F'
          }
        },
        shape: {
          style: {
            symbolType: 'square'
          }
        }
      },
      pager: {
        textStyle: {},
        handler: {
          style: {},
          state: {
            disable: {}
          }
        }
      },
      data: [
        {
          label: '超级长的销售额超级长的销售额超级长的销售额超级长的销售额超级长的销售额',
          shape: {
            fill: '#2E62F1',
            symbolType: 'square'
          }
        },
        {
          label: '利润',
          shape: {
            fill: '#4DC36A',
            symbolType: 'square'
          }
        }
      ],
      padding: [16, 0, 0, 0]
    },
    title: {
      text: '',
      align: 'center',
      orient: 'top',
      textStyle: {
        fontSize: 12,
        fill: '#333333',
        fontWeight: 'bold'
      }
    },
    hash: '4889be53ca96488f6891e0e63ff9ac56'
  };

  const tableInstance = new VTable.PivotChart(document.getElementById(CONTAINER_ID), option);
  // tableInstance.listenChart('click', args => {
  //   console.log('listenChart click', args);
  // });
  // tableInstance.listenChart('mouseover', args => {
  //   console.log('listenChart mouseover', args);
  // });
  window.tableInstance = tableInstance;

  bindDebugTool(tableInstance.scenegraph.stage, {});
}
