import * as VTable from '../../src';
import { bindDebugTool } from '../../src/scenegraph/debug-tool';
const BUGSERVER_CONTAINER_ID = 'vTable';
window.BUGSERVER_SCREENSHOT = () => {
  // do nothing
};
window.BUGSERVER_RELEASE = () => {
  // do nothing
};

// your code here
import('https://unpkg.com/@visactor/vchart@latest/build/index.min.js')
  .then(async () => {
    VTable.register.chartModule('vchart', window.VChart.default);
    const dom = document.querySelector('#' + BUGSERVER_CONTAINER_ID);
    dom.style.width = '800px';
    dom.style.height = '400px';
    const option = {
      widthMode: 'adaptive',
      heightMode: 'adaptive',
      columnTree: [],
      rowTree: [
        {
          dimensionKey: '230223152457181',
          value: '抖极/(抖极+抖音)'
        }
      ],
      columns: [],
      rows: [
        {
          dimensionKey: '230223152457181',
          title: 'APP'
        }
      ],
      axes: [
        {
          type: 'band',
          tick: {
            visible: false
          },
          grid: {
            visible: false,
            style: {
              zIndex: 150,
              stroke: '#DADCDD',
              lineWidth: 1,
              lineDash: [4, 2]
            }
          },
          orient: 'bottom',
          visible: true,
          domainLine: {
            visible: true,
            style: {
              lineWidth: 1,
              stroke: '#989999'
            }
          },
          title: {
            visible: false,
            space: 5,
            text: 'p_date',
            style: {
              fontSize: 12,
              fill: '#363839',
              fontWeight: 'normal'
            }
          },
          sampling: false,
          zIndex: 200,
          label: {
            visible: true,
            space: 4,
            style: {
              fontSize: 12,
              fill: '#6F6F6F',
              angle: 90,
              fontWeight: 'normal',
              direction: 'horizontal',
              maxLineWidth: 174
            },
            autoHide: true,
            autoHideMethod: 'greedy',
            flush: false
          },
          hover: true,
          background: {
            visible: true,
            state: {
              hover: {
                fillOpacity: 0.08,
                fill: '#141414'
              },
              hover_reverse: {
                fillOpacity: 0.08,
                fill: '#141414'
              }
            }
          },
          paddingInner: 0.36249999999999993,
          paddingOuter: 0.175
        },
        {
          type: 'linear',
          tick: {
            visible: false,
            tickMode: 'd3',
            style: {
              stroke: 'rgba(255, 255, 255, 0)'
            }
          },
          niceType: 'accurateFirst',
          zIndex: 200,
          grid: {
            visible: true,
            style: {
              zIndex: 150,
              stroke: '#DADCDD',
              lineWidth: 1,
              lineDash: [4, 2]
            }
          },
          orient: 'left',
          visible: true,
          domainLine: {
            visible: true,
            style: {
              lineWidth: 1,
              stroke: 'rgba(255, 255, 255, 0)'
            }
          },
          title: {
            visible: false,
            text: '货架场景_商卡GMV',
            space: 8,
            style: {
              fontSize: 12,
              fill: '#363839',
              fontWeight: 'normal'
            }
          },
          sampling: false,
          label: {
            visible: true,
            space: 6,
            flush: true,
            padding: 0,
            style: {
              fontSize: 12,
              maxLineWidth: 174,
              fill: '#6F6F6F',
              angle: 0,
              fontWeight: 'normal',
              dy: -1,
              direction: 'horizontal'
            },
            autoHide: true,
            autoHideMethod: 'greedy'
          },
          hover: true,
          background: {
            visible: true,
            state: {
              hover: {
                fillOpacity: 0.08,
                fill: '#141414'
              },
              hover_reverse: {
                fillOpacity: 0.08,
                fill: '#141414'
              }
            }
          },
          zero: false,
          nice: true
        }
      ],
      indicators: [
        {
          indicatorKey: '10002',
          title: '',
          width: 'auto',
          cellType: 'chart',
          chartModule: 'vchart',
          style: {
            padding: [1, 1, 0, 1]
          },
          chartSpec: {
            type: 'line',
            xField: ['230223152457540'],
            yField: ['10002'],
            direction: 'vertical',
            sortDataByAxis: true,
            seriesField: '20001',
            padding: 0,
            labelLayout: 'region',
            data: {
              id: 'data',
              fields: {
                '10001': {
                  alias: '指标名称 '
                },
                '10002': {
                  alias: '指标值 '
                },
                '20001': {
                  alias: '图例项 ',
                  domain: [
                    '抖极/(抖极+抖音)-货架场景_商卡GMV',
                    '抖极/(抖极+抖音)-商城商卡GMV',
                    '抖极/(抖极+抖音)-搜索商城外商卡gmv',
                    '抖极/(抖极+抖音)-店橱商卡gmv'
                  ],
                  sortIndex: 0,
                  lockStatisticsByDomain: true
                },
                '230223152457181': {
                  alias: 'APP'
                },
                '230223152457481': {
                  alias: 'APP'
                },
                '230223152457540': {
                  alias: 'p_date',
                  domain: [
                    '2023-09-01',
                    '2023-09-02',
                    '2023-09-03',
                    '2023-09-04',
                    '2023-09-05',
                    '2023-09-06',
                    '2023-09-07',
                    '2023-09-08',
                    '2023-09-09',
                    '2023-09-10',
                    '2023-09-11',
                    '2023-09-12',
                    '2023-09-13',
                    '2023-09-14',
                    '2023-09-15',
                    '2023-09-16',
                    '2023-09-17',
                    '2023-09-18',
                    '2023-09-19',
                    '2023-09-20',
                    '2023-09-21',
                    '2023-09-22',
                    '2023-09-23',
                    '2023-09-24',
                    '2023-09-25',
                    '2023-09-26',
                    '2023-09-27',
                    '2023-09-28',
                    '2023-09-29',
                    '2023-09-30',
                    '2023-10-01',
                    '2023-10-02',
                    '2023-10-03',
                    '2023-10-04',
                    '2023-10-05',
                    '2023-10-06',
                    '2023-10-07',
                    '2023-10-08',
                    '2023-10-09',
                    '2023-10-10',
                    '2023-10-11',
                    '2023-10-12',
                    '2023-10-13',
                    '2023-10-14',
                    '2023-10-15',
                    '2023-10-16',
                    '2023-10-17',
                    '2023-10-18',
                    '2023-10-19',
                    '2023-10-20',
                    '2023-10-21',
                    '2023-10-22',
                    '2023-10-23',
                    '2023-10-24',
                    '2023-10-25',
                    '2023-10-26',
                    '2023-10-27',
                    '2023-10-28',
                    '2023-10-29',
                    '2023-10-30',
                    '2023-10-31',
                    '2023-11-01',
                    '2023-11-02'
                  ],
                  sortIndex: 0,
                  lockStatisticsByDomain: true
                },
                '230223211518819': {
                  alias: '货架场景_商卡GMV'
                },
                '230223211518821': {
                  alias: '搜索商城外商卡gmv'
                },
                '230223211518822': {
                  alias: '店橱商卡gmv'
                },
                '230223211519073': {
                  alias: '商城商卡GMV'
                }
              }
            },
            stackInverse: true,
            axes: [
              {
                type: 'band',
                tick: {
                  visible: false
                },
                grid: {
                  visible: false,
                  style: {
                    zIndex: 150,
                    stroke: '#DADCDD',
                    lineWidth: 1,
                    lineDash: [4, 2]
                  }
                },
                orient: 'bottom',
                visible: true,
                domainLine: {
                  visible: true,
                  style: {
                    lineWidth: 1,
                    stroke: '#989999'
                  }
                },
                title: {
                  visible: false,
                  space: 5,
                  text: 'p_date',
                  style: {
                    fontSize: 12,
                    fill: '#363839',
                    fontWeight: 'normal'
                  }
                },
                sampling: false,
                zIndex: 200,
                label: {
                  visible: true,
                  space: 4,
                  style: {
                    fontSize: 12,
                    fill: '#6F6F6F',
                    angle: 90,
                    fontWeight: 'normal',
                    direction: 'horizontal',
                    maxLineWidth: 174
                  },
                  autoHide: true,
                  autoHideMethod: 'greedy',
                  flush: false
                },
                hover: false,
                background: {
                  visible: true,
                  state: {
                    hover: {
                      fillOpacity: 0.08,
                      fill: '#141414'
                    },
                    hover_reverse: {
                      fillOpacity: 0.08,
                      fill: '#141414'
                    }
                  }
                },
                paddingInner: 0.36249999999999993,
                paddingOuter: 0.175
              },
              {
                type: 'linear',
                tick: {
                  visible: false,
                  tickMode: 'd3',
                  style: {
                    stroke: 'rgba(255, 255, 255, 0)'
                  }
                },
                niceType: 'accurateFirst',
                zIndex: 200,
                grid: {
                  visible: true,
                  style: {
                    zIndex: 150,
                    stroke: '#DADCDD',
                    lineWidth: 1,
                    lineDash: [4, 2]
                  }
                },
                orient: 'left',
                visible: true,
                domainLine: {
                  visible: true,
                  style: {
                    lineWidth: 1,
                    stroke: 'rgba(255, 255, 255, 0)'
                  }
                },
                title: {
                  visible: false,
                  text: '货架场景_商卡GMV',
                  space: 8,
                  style: {
                    fontSize: 12,
                    fill: '#363839',
                    fontWeight: 'normal'
                  }
                },
                sampling: false,
                label: {
                  visible: true,
                  space: 6,
                  flush: true,
                  padding: 0,
                  style: {
                    fontSize: 12,
                    maxLineWidth: 174,
                    fill: '#6F6F6F',
                    angle: 0,
                    fontWeight: 'normal',
                    dy: -1,
                    direction: 'horizontal'
                  },
                  autoHide: true,
                  autoHideMethod: 'greedy'
                },
                hover: false,
                background: {
                  visible: true,
                  state: {
                    hover: {
                      fillOpacity: 0.08,
                      fill: '#141414'
                    },
                    hover_reverse: {
                      fillOpacity: 0.08,
                      fill: '#141414'
                    }
                  }
                },
                zero: false,
                nice: true
              }
            ],
            color: {
              field: '20001',
              type: 'ordinal',
              range: ['#2E62F1', '#4DC36A', '#FF8406', '#FFCC00'],
              specified: {},
              domain: [
                '抖极/(抖极+抖音)-货架场景_商卡GMV',
                '抖极/(抖极+抖音)-商城商卡GMV',
                '抖极/(抖极+抖音)-搜索商城外商卡gmv',
                '抖极/(抖极+抖音)-店橱商卡gmv'
              ]
            },
            label: {
              visible: false,
              offset: 0,
              overlap: {
                hideOnHit: true,
                avoidBaseMark: false,
                strategy: [
                  {
                    type: 'position',
                    position: ['top', 'bottom']
                  },
                  {
                    type: 'moveY',
                    offset: [-5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5]
                  },
                  {
                    type: 'moveX',
                    offset: [-5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5]
                  }
                ],
                clampForce: true
              },
              style: {
                fontSize: 12,
                fontWeight: 'normal',
                zIndex: 400,
                fill: '#363839',
                stroke: 'rgba(255, 255, 255, 0.8)',
                lineWidth: 1,
                strokeOpacity: 1
              },
              position: 'top',
              smartInvert: false
            },
            tooltip: {
              handler: {}
            },
            point: {
              style: {
                shape: {
                  type: 'ordinal',
                  field: '20001',
                  range: ['circle'],
                  domain: [
                    '抖极/(抖极+抖音)-货架场景_商卡GMV',
                    '抖极/(抖极+抖音)-商城商卡GMV',
                    '抖极/(抖极+抖音)-搜索商城外商卡gmv',
                    '抖极/(抖极+抖音)-店橱商卡gmv'
                  ]
                },
                size: {
                  type: 'ordinal',
                  field: '20001',
                  range: [7.0898154036220635],
                  domain: [
                    '抖极/(抖极+抖音)-货架场景_商卡GMV',
                    '抖极/(抖极+抖音)-商城商卡GMV',
                    '抖极/(抖极+抖音)-搜索商城外商卡gmv',
                    '抖极/(抖极+抖音)-店橱商卡gmv'
                  ]
                },
                fill: {
                  field: '20001',
                  type: 'ordinal',
                  range: ['#2E62F1', '#4DC36A', '#FF8406', '#FFCC00'],
                  specified: {},
                  domain: [
                    '抖极/(抖极+抖音)-货架场景_商卡GMV',
                    '抖极/(抖极+抖音)-商城商卡GMV',
                    '抖极/(抖极+抖音)-搜索商城外商卡gmv',
                    '抖极/(抖极+抖音)-店橱商卡gmv'
                  ]
                },
                stroke: {
                  field: '20001',
                  type: 'ordinal',
                  range: ['#2E62F1', '#4DC36A', '#FF8406', '#FFCC00'],
                  specified: {},
                  domain: [
                    '抖极/(抖极+抖音)-货架场景_商卡GMV',
                    '抖极/(抖极+抖音)-商城商卡GMV',
                    '抖极/(抖极+抖音)-搜索商城外商卡gmv',
                    '抖极/(抖极+抖音)-店橱商卡gmv'
                  ]
                },
                strokeOpacity: {
                  type: 'ordinal',
                  field: '20001',
                  range: [1],
                  domain: [
                    '抖极/(抖极+抖音)-货架场景_商卡GMV',
                    '抖极/(抖极+抖音)-商城商卡GMV',
                    '抖极/(抖极+抖音)-搜索商城外商卡gmv',
                    '抖极/(抖极+抖音)-店橱商卡gmv'
                  ]
                },
                fillOpacity: {
                  type: 'ordinal',
                  field: '20001',
                  range: [1],
                  domain: [
                    '抖极/(抖极+抖音)-货架场景_商卡GMV',
                    '抖极/(抖极+抖音)-商城商卡GMV',
                    '抖极/(抖极+抖音)-搜索商城外商卡gmv',
                    '抖极/(抖极+抖音)-店橱商卡gmv'
                  ]
                }
              },
              state: {
                hover: {
                  lineWidth: 2,
                  fillOpacity: 1,
                  strokeOpacity: 1,
                  scaleX: 1.5,
                  scaleY: 1.5
                }
              }
            },
            line: {
              style: {
                curveType: {
                  type: 'ordinal',
                  field: '20001',
                  range: ['linear'],
                  domain: [
                    '抖极/(抖极+抖音)-货架场景_商卡GMV',
                    '抖极/(抖极+抖音)-商城商卡GMV',
                    '抖极/(抖极+抖音)-搜索商城外商卡gmv',
                    '抖极/(抖极+抖音)-店橱商卡gmv'
                  ]
                },
                lineWidth: {
                  type: 'ordinal',
                  field: '20001',
                  range: [3],
                  domain: [
                    '抖极/(抖极+抖音)-货架场景_商卡GMV',
                    '抖极/(抖极+抖音)-商城商卡GMV',
                    '抖极/(抖极+抖音)-搜索商城外商卡gmv',
                    '抖极/(抖极+抖音)-店橱商卡gmv'
                  ]
                },
                lineDash: {
                  type: 'ordinal',
                  field: '20001',
                  range: [[0, 0]],
                  domain: [
                    '抖极/(抖极+抖音)-货架场景_商卡GMV',
                    '抖极/(抖极+抖音)-商城商卡GMV',
                    '抖极/(抖极+抖音)-搜索商城外商卡gmv',
                    '抖极/(抖极+抖音)-店橱商卡gmv'
                  ]
                }
              }
            },
            seriesMark: 'line',
            region: [
              {
                clip: true
              }
            ],
            background: 'rgba(255, 255, 255, 0)',
            area: {
              style: {
                curveType: {
                  type: 'ordinal',
                  field: '20001',
                  range: ['linear'],
                  domain: [
                    '抖极/(抖极+抖音)-货架场景_商卡GMV',
                    '抖极/(抖极+抖音)-商城商卡GMV',
                    '抖极/(抖极+抖音)-搜索商城外商卡gmv',
                    '抖极/(抖极+抖音)-店橱商卡gmv'
                  ]
                }
              }
            },
            invalidType: 'break',
            animation: false,
            crosshair: {
              xField: {
                visible: true
              },
              gridZIndex: 100
            }
          }
        }
      ],
      indicatorsAsCol: false,
      records: [
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.116865',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-05',
          '230223211518819': '0.116865'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.058174078368',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-05',
          '230223211519073': '0.058174078368'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.125284',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-05',
          '230223211518821': '0.125284'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.097727',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-05',
          '230223211518822': '0.097727'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.114421',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-19',
          '230223211518819': '0.114421'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.05775336549',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-19',
          '230223211519073': '0.05775336549'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.122881',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-19',
          '230223211518821': '0.122881'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.098371',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-19',
          '230223211518822': '0.098371'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.097681',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-20',
          '230223211518819': '0.097681'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.047852635576',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-20',
          '230223211519073': '0.047852635576'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.11124',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-20',
          '230223211518821': '0.11124'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.09219',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-20',
          '230223211518822': '0.09219'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.115569',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-07',
          '230223211518819': '0.115569'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.05772524537200001',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-07',
          '230223211519073': '0.05772524537200001'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.123608',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-07',
          '230223211518821': '0.123608'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.097237',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-07',
          '230223211518822': '0.097237'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.122304',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-15',
          '230223211518819': '0.122304'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.06364705674',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-15',
          '230223211519073': '0.06364705674'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.125753',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-15',
          '230223211518821': '0.125753'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.102742',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-15',
          '230223211518822': '0.102742'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.1162',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-26',
          '230223211518819': '0.1162'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.060234594389',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-26',
          '230223211519073': '0.060234594389'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.11862',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-26',
          '230223211518821': '0.11862'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.097932',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-26',
          '230223211518822': '0.097932'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.109525',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-29',
          '230223211518819': '0.109525'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.056076786636000006',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-29',
          '230223211519073': '0.056076786636000006'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.122392',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-29',
          '230223211518821': '0.122392'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.10035',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-29',
          '230223211518822': '0.10035'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.116276',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-14',
          '230223211518819': '0.116276'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.058709828214000004',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-14',
          '230223211519073': '0.058709828214000004'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.122292',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-14',
          '230223211518821': '0.122292'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.097431',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-14',
          '230223211518822': '0.097431'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.110957',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-15',
          '230223211518819': '0.110957'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.056335544582',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-15',
          '230223211519073': '0.056335544582'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.104137',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-15',
          '230223211518821': '0.104137'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.09841',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-15',
          '230223211518822': '0.09841'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.1077',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-28',
          '230223211518819': '0.1077'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.055017598728',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-28',
          '230223211519073': '0.055017598728'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.121462',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-28',
          '230223211518821': '0.121462'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.099545',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-28',
          '230223211518822': '0.099545'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.119388',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-27',
          '230223211518819': '0.119388'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.061822189624999996',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-27',
          '230223211519073': '0.061822189624999996'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.120111',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-27',
          '230223211518821': '0.120111'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.096843',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-27',
          '230223211518822': '0.096843'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.123603',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-14',
          '230223211518819': '0.123603'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.06412282905599999',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-14',
          '230223211519073': '0.06412282905599999'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.127273',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-14',
          '230223211518821': '0.127273'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.102686',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-14',
          '230223211518822': '0.102686'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.116367',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-06',
          '230223211518819': '0.116367'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.05841579744',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-06',
          '230223211519073': '0.05841579744'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.123268',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-06',
          '230223211518821': '0.123268'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.097427',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-06',
          '230223211518822': '0.097427'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.110226',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-21',
          '230223211518819': '0.110226'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.056230168158',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-21',
          '230223211519073': '0.056230168158'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.119765',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-21',
          '230223211518821': '0.119765'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.09734',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-21',
          '230223211518822': '0.09734'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.12039',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-06',
          '230223211518819': '0.12039'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.06224716425400001',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-06',
          '230223211519073': '0.06224716425400001'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.127797',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-06',
          '230223211518821': '0.127797'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.10116',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-06',
          '230223211518822': '0.10116'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.116695',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-18',
          '230223211518819': '0.116695'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.059595581136000005',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-18',
          '230223211519073': '0.059595581136000005'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.11888',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-18',
          '230223211518821': '0.11888'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.098189',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-18',
          '230223211518822': '0.098189'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.116846',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-09',
          '230223211518819': '0.116846'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.05890923995999999',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-09',
          '230223211519073': '0.05890923995999999'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.127156',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-09',
          '230223211518821': '0.127156'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.097671',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-09',
          '230223211518822': '0.097671'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.109887',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-30',
          '230223211518819': '0.109887'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.05597065550599999',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-30',
          '230223211519073': '0.05597065550599999'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.121923',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-30',
          '230223211518821': '0.121923'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.099968',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-30',
          '230223211518822': '0.099968'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.120833',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-29',
          '230223211518819': '0.120833'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.062337071307',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-29',
          '230223211519073': '0.062337071307'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.127598',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-29',
          '230223211518821': '0.127598'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.100769',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-29',
          '230223211518822': '0.100769'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.121961',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-12',
          '230223211518819': '0.121961'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.06298575029',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-12',
          '230223211519073': '0.06298575029'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.126574',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-12',
          '230223211518821': '0.126574'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.103013',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-12',
          '230223211518822': '0.103013'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.107704',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-23',
          '230223211518819': '0.107704'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.05410059279',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-23',
          '230223211519073': '0.05410059279'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.117889',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-23',
          '230223211518821': '0.117889'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.09473',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-23',
          '230223211518822': '0.09473'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.11305',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-20',
          '230223211518819': '0.11305'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.057770862984000006',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-20',
          '230223211519073': '0.057770862984000006'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.118717',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-20',
          '230223211518821': '0.118717'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.095606',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-20',
          '230223211518822': '0.095606'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.121599',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-05',
          '230223211518819': '0.121599'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.06276775427999999',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-05',
          '230223211519073': '0.06276775427999999'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.129202',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-05',
          '230223211518821': '0.129202'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.10293',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-05',
          '230223211518822': '0.10293'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.121703',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-04',
          '230223211518819': '0.121703'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.0625689042',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-04',
          '230223211519073': '0.0625689042'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.128183',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-04',
          '230223211518821': '0.128183'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.103594',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-04',
          '230223211518822': '0.103594'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.114417',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-21',
          '230223211518819': '0.114417'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.05819448965599999',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-21',
          '230223211519073': '0.05819448965599999'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.121552',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-21',
          '230223211518821': '0.121552'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.096947',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-21',
          '230223211518822': '0.096947'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.10923',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-22',
          '230223211518819': '0.10923'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.05401702345',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-22',
          '230223211519073': '0.05401702345'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.118332',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-22',
          '230223211518821': '0.118332'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.097618',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-22',
          '230223211518822': '0.097618'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.11491',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-01',
          '230223211518819': '0.11491'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.057362929911000005',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-01',
          '230223211519073': '0.057362929911000005'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.124106',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-01',
          '230223211518821': '0.124106'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.098283',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-01',
          '230223211518822': '0.098283'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.120995',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-13',
          '230223211518819': '0.120995'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.063008596624',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-13',
          '230223211519073': '0.063008596624'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.124966',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-13',
          '230223211518821': '0.124966'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.101231',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-13',
          '230223211518822': '0.101231'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.116843',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-28',
          '230223211518819': '0.116843'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.06073866486',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-28',
          '230223211519073': '0.06073866486'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.119175',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-28',
          '230223211518821': '0.119175'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.098783',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-28',
          '230223211518822': '0.098783'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.120651',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-07',
          '230223211518819': '0.120651'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.062205839982',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-07',
          '230223211519073': '0.062205839982'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.127908',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-07',
          '230223211518821': '0.127908'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.100444',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-07',
          '230223211518822': '0.100444'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.097834',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-31',
          '230223211518819': '0.097834'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.05042411451',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-31',
          '230223211519073': '0.05042411451'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.108326',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-31',
          '230223211518821': '0.108326'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.091035',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-31',
          '230223211518822': '0.091035'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.122378',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-11',
          '230223211518819': '0.122378'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.063618339664',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-11',
          '230223211519073': '0.063618339664'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.128924',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-11',
          '230223211518821': '0.128924'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.102499',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-11',
          '230223211518822': '0.102499'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.10875',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-11-02',
          '230223211518819': '0.10875'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.05651742660200001',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-11-02',
          '230223211519073': '0.05651742660200001'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.121196',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-11-02',
          '230223211518821': '0.121196'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.098931',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-11-02',
          '230223211518822': '0.098931'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.121176',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-18',
          '230223211518819': '0.121176'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.06217838179',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-18',
          '230223211519073': '0.06217838179'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.129845',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-18',
          '230223211518821': '0.129845'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.100879',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-18',
          '230223211518822': '0.100879'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.117599',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-17',
          '230223211518819': '0.117599'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.059658753839999995',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-17',
          '230223211519073': '0.059658753839999995'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.121939',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-17',
          '230223211518821': '0.121939'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.100613',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-17',
          '230223211518822': '0.100613'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.120483',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-08',
          '230223211518819': '0.120483'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.06237318885',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-08',
          '230223211519073': '0.06237318885'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.127461',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-08',
          '230223211518821': '0.127461'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.09958',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-08',
          '230223211518822': '0.09958'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.117442',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-12',
          '230223211518819': '0.117442'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.05864095749599999',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-12',
          '230223211519073': '0.05864095749599999'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.124954',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-12',
          '230223211518821': '0.124954'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.098549',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-12',
          '230223211518822': '0.098549'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.107176',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-27',
          '230223211518819': '0.107176'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.05394774385',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-27',
          '230223211519073': '0.05394774385'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.121236',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-27',
          '230223211518821': '0.121236'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.097822',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-27',
          '230223211518822': '0.097822'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.119448',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-24',
          '230223211518819': '0.119448'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.060820082321999994',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-24',
          '230223211519073': '0.060820082321999994'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.125514',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-24',
          '230223211518821': '0.125514'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.101421',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-24',
          '230223211518822': '0.101421'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.121672',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-17',
          '230223211518819': '0.121672'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.06232675296400001',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-17',
          '230223211519073': '0.06232675296400001'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.132237',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-17',
          '230223211518821': '0.132237'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.100371',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-17',
          '230223211518822': '0.100371'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.121134',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-16',
          '230223211518819': '0.121134'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.062353130112',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-16',
          '230223211519073': '0.062353130112'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.125387',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-16',
          '230223211518821': '0.125387'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.101204',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-16',
          '230223211518822': '0.101204'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.116757',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-25',
          '230223211518819': '0.116757'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.059392074225',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-25',
          '230223211519073': '0.059392074225'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.119179',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-25',
          '230223211518821': '0.119179'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.098623',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-25',
          '230223211518822': '0.098623'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.107312',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-26',
          '230223211518819': '0.107312'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.05429443336999999',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-26',
          '230223211519073': '0.05429443336999999'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.119822',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-26',
          '230223211518821': '0.119822'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.096824',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-26',
          '230223211518822': '0.096824'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.116921',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-13',
          '230223211518819': '0.116921'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.058799947371',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-13',
          '230223211519073': '0.058799947371'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.125539',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-13',
          '230223211518821': '0.125539'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.0986',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-13',
          '230223211518822': '0.0986'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.120509',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-09',
          '230223211518819': '0.120509'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.06200099622599999',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-09',
          '230223211519073': '0.06200099622599999'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.127764',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-09',
          '230223211518821': '0.127764'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.101318',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-09',
          '230223211518822': '0.101318'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.116745',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-16',
          '230223211518819': '0.116745'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.059515587893999994',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-16',
          '230223211519073': '0.059515587893999994'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.120359',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-16',
          '230223211518821': '0.120359'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.099254',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-16',
          '230223211518822': '0.099254'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.121596',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-30',
          '230223211518819': '0.121596'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.06293012389199999',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-30',
          '230223211519073': '0.06293012389199999'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.12979',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-30',
          '230223211518821': '0.12979'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.102708',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-30',
          '230223211518822': '0.102708'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.120191',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-19',
          '230223211518819': '0.120191'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.06249097894800001',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-19',
          '230223211519073': '0.06249097894800001'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.126823',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-19',
          '230223211518821': '0.126823'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.100491',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-19',
          '230223211518822': '0.100491'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.121097',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-10',
          '230223211518819': '0.121097'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.06252643278600001',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-10',
          '230223211519073': '0.06252643278600001'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.129134',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-10',
          '230223211518821': '0.129134'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.100595',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-10',
          '230223211518822': '0.100595'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.1224',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-01',
          '230223211518819': '0.1224'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.06328914677400001',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-01',
          '230223211519073': '0.06328914677400001'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.13051',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-01',
          '230223211518821': '0.13051'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.103807',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-01',
          '230223211518822': '0.103807'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.10772',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-11-01',
          '230223211518819': '0.10772'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.056903892984000004',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-11-01',
          '230223211519073': '0.056903892984000004'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.118283',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-11-01',
          '230223211518821': '0.118283'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.098115',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-11-01',
          '230223211518822': '0.098115'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.116061',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-11',
          '230223211518819': '0.116061'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.058917189824999994',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-11',
          '230223211519073': '0.058917189824999994'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.124709',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-11',
          '230223211518821': '0.124709'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.096057',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-11',
          '230223211518822': '0.096057'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.122218',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-03',
          '230223211518819': '0.122218'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.062769034296',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-03',
          '230223211519073': '0.062769034296'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.129225',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-03',
          '230223211518821': '0.129225'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.104129',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-03',
          '230223211518822': '0.104129'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.111176',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-22',
          '230223211518819': '0.111176'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.05760960402799999',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-22',
          '230223211519073': '0.05760960402799999'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.110011',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-22',
          '230223211518821': '0.110011'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.096812',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-22',
          '230223211518822': '0.096812'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.107618',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-25',
          '230223211518819': '0.107618'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.054711093843',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-25',
          '230223211519073': '0.054711093843'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.119086',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-25',
          '230223211518821': '0.119086'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.094758',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-25',
          '230223211518822': '0.094758'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.116299',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-02',
          '230223211518819': '0.116299'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.058203628532',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-02',
          '230223211519073': '0.058203628532'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.126397',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-02',
          '230223211518821': '0.126397'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.097962',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-02',
          '230223211518822': '0.097962'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.114799',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-03',
          '230223211518819': '0.114799'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.057643897853999995',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-03',
          '230223211519073': '0.057643897853999995'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.123943',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-03',
          '230223211518821': '0.123943'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.098487',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-03',
          '230223211518822': '0.098487'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.106759',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-24',
          '230223211518819': '0.106759'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.053710623746000004',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-24',
          '230223211519073': '0.053710623746000004'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.112099',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-24',
          '230223211518821': '0.112099'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.09583',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-24',
          '230223211518822': '0.09583'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.118385',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-23',
          '230223211518819': '0.118385'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.06058497793400001',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-23',
          '230223211519073': '0.06058497793400001'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.121361',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-23',
          '230223211518821': '0.121361'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.099906',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-23',
          '230223211518822': '0.099906'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.123313',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-02',
          '230223211518819': '0.123313'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.06340892094',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-02',
          '230223211519073': '0.06340892094'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.130425',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-02',
          '230223211518821': '0.130425'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.105899',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-10-02',
          '230223211518822': '0.105899'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.11771',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-10',
          '230223211518819': '0.11771'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.059645024386',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-10',
          '230223211519073': '0.059645024386'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.127776',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-10',
          '230223211518821': '0.127776'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.098034',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-10',
          '230223211518822': '0.098034'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.114726',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-04',
          '230223211518819': '0.114726'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.057302618820000005',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-04',
          '230223211519073': '0.057302618820000005'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.123211',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-04',
          '230223211518821': '0.123211'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.096463',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-04',
          '230223211518822': '0.096463'
        },
        {
          '10001': '货架场景_商卡GMV',
          '10002': '0.115885',
          '10003': '230223211518819',
          '20001': '抖极/(抖极+抖音)-货架场景_商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-08',
          '230223211518819': '0.115885'
        },
        {
          '10001': '商城商卡GMV',
          '10002': '0.058597160646',
          '10003': '230223211519073',
          '20001': '抖极/(抖极+抖音)-商城商卡GMV',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-08',
          '230223211519073': '0.058597160646'
        },
        {
          '10001': '搜索商城外商卡gmv',
          '10002': '0.126176',
          '10003': '230223211518821',
          '20001': '抖极/(抖极+抖音)-搜索商城外商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-08',
          '230223211518821': '0.126176'
        },
        {
          '10001': '店橱商卡gmv',
          '10002': '0.097651',
          '10003': '230223211518822',
          '20001': '抖极/(抖极+抖音)-店橱商卡gmv',
          '230223152457181': '抖极/(抖极+抖音)',
          '230223152457481': '抖极/(抖极+抖音)',
          '230223152457540': '2023-09-08',
          '230223211518822': '0.097651'
        }
      ],
      indicatorTitle: '',
      autoWrapText: true,
      legends: [
        {
          type: 'discrete',
          visible: false
        }
      ],
      corner: {
        titleOnDimension: 'row'
      },
      title: {
        text: '',
        align: 'center',
        orient: 'top',
        padding: [3, 0, 5, 0],
        textStyle: {
          fontSize: 12,
          fill: '#333333',
          fontWeight: 'bold'
        }
      },
      defaultHeaderColWidth: [80, 'auto'],
      theme: {
        bodyStyle: {
          borderColor: 'rgba(0,4,20,0.2)',
          borderLineWidth: [1, 0, 0, 1],
          padding: 1
        },
        headerStyle: {
          borderColor: 'rgba(0,4,20,0.2)',
          fontSize: 12,
          color: '#333333',
          textAlign: 'center',
          borderLineWidth: [0, 0, 1, 1],
          padding: [4, 0, 4, 0],
          hover: {
            cellBgColor: '#eceded'
          }
        },
        rowHeaderStyle: {
          borderColor: 'rgba(0,4,20,0.2)',
          fontSize: 12,
          color: '#333333',
          padding: [0, 0, 0, 4],
          borderLineWidth: [1, 1, 0, 0],
          hover: {
            cellBgColor: '#eceded'
          }
        },
        cornerHeaderStyle: {
          borderColor: 'rgba(0,4,20,0.2)',
          textAlign: 'center',
          fontSize: 12,
          color: '#333333',
          fontWeight: 'bold',
          borderLineWidth: [0, 1, 1, 0],
          padding: 0,
          hover: {
            cellBgColor: ''
          }
        },
        cornerRightTopCellStyle: {
          borderColor: 'rgba(0,4,20,0.2)',
          borderLineWidth: [0, 0, 1, 1],
          padding: 0,
          hover: {
            cellBgColor: ''
          }
        },
        cornerLeftBottomCellStyle: {
          borderColor: 'rgba(0,4,20,0.2)',
          borderLineWidth: [1, 0, 0, 0],
          hover: {
            cellBgColor: ''
          }
        },
        cornerRightBottomCellStyle: {
          borderColor: 'rgba(0,4,20,0.2)',
          borderLineWidth: [1, 0, 0, 1],
          hover: {
            cellBgColor: ''
          }
        },
        rightFrozenStyle: {
          borderColor: 'rgba(0,4,20,0.2)',
          borderLineWidth: [1, 0, 1, 1],
          hover: {
            cellBgColor: '#eceded'
          }
        },
        bottomFrozenStyle: {
          borderColor: 'rgba(0,4,20,0.2)',
          borderLineWidth: [1, 0, 0, 1],
          padding: 0,
          hover: {
            cellBgColor: '#eceded'
          }
        },
        selectionStyle: {
          cellBgColor: '',
          cellBorderColor: ''
        },
        frameStyle: {
          borderLineWidth: 0
        }
      },
      hash: '20cf6b1a190271fdf0cc982d54497c00'
    };

    option.container = dom;
    const instance = new VTable.PivotChart(option);
    bindDebugTool(instance.scenegraph.stage, { customGrapicKeys: ['col', 'row'] });

    window.BUGSERVER_SCREENSHOT();

    // do some unmount operation
    window.BUGSERVER_RELEASE(() => {
      instance.dispose();
    });
  })
  .catch(err => {
    console.error('Failed import CDN resource: ', err);
    window.BUGSERVER_SCREENSHOT && window.BUGSERVER_SCREENSHOT();
  });
