/* eslint-disable */
import * as VTable from '../../src';
import VChart from '@visactor/vchart';
import { bindDebugTool } from '../../src/scenegraph/debug-tool';
const CONTAINER_ID = 'vTable';
VTable.register.chartModule('vchart', VChart);
export function createTable() {
  const option: VTable.PivotChartConstructorOptions = {
    animation: true,
    chartDimensionLinkage: {
      showTooltip: true,
      heightLimitToShowTooltipForEdgeRow: 60,
      widthLimitToShowTooltipForEdgeColumn: 90,
      labelHoverOnAxis: {
        left: {
          visible: true
        }
      }
    },
    rows: [
      {
        dimensionKey: 'ro_20251104185427_c32d',
        title: 'customer_type'
      }
    ],
    columns: [
      {
        dimensionKey: 'co_20251104185439_08d5',
        title: 'area'
      }
    ],
    indicators: [
      {
        indicatorKey: 'yA_20251104185257_cc73',
        title: 'sum(amount)',
        cellType: 'chart',
        chartModule: 'vchart',
        chartSpec: {
          type: 'bar',
          direction: 'horizontal',
          yField: '__Dim_Y__',
          xField: '__MeaValue__yA_20251104185257_cc73',
          seriesField: '__Dim_ColorId__',
          padding: 0,
          region: [
            {
              clip: true
            }
          ],
          animation: true,
          barMaxWidth: 72,
          color: {
            type: 'ordinal',
            domain: ['yA_20251104185257_cc73'],
            range: ['#7E5DFF', '#BCB5D6', '#5B5F89', '#80E1D9', '#F8BC3B', '#B2596E', '#72BEF4', '#C9A0FF']
          },
          background: 'transparent',
          data: {
            id: 'yA_20251104185257_cc73',
            fields: {
              __Dim_Angle__: {
                sortIndex: 0
              },
              __Dim_Y__: {
                sortIndex: 0
              },
              __Dim_ColorId__: {
                sortIndex: 0
              }
            }
          },
          large: false,
          largeThreshold: null,
          progressiveStep: 400,
          progressiveThreshold: null,
          axes: [
            {
              range: {},
              visible: true,
              type: 'linear',
              base: 10,
              orient: 'bottom',
              nice: true,
              zero: true,
              inverse: false,
              label: {
                space: 8,
                visible: true,
                style: {
                  fill: '#BCC1CB',
                  angle: 0,
                  fontSize: 12,
                  fontWeight: 400
                }
              },
              title: {
                visible: false,
                text: 'sum(amount)',
                style: {
                  fill: '#606773',
                  fontSize: 12,
                  fontWeight: 400
                }
              },
              tick: {
                visible: false,
                tickSize: 4,
                inside: false,
                style: {
                  stroke: '#21252C'
                }
              },
              grid: {
                visible: true,
                style: {
                  lineWidth: 1,
                  stroke: '#F0F1F6',
                  lineDash: [4, 2]
                }
              },
              domainLine: {
                visible: false
              },
              innerOffset: {
                right: 12
              }
            },
            {
              visible: true,
              type: 'band',
              orient: 'left',
              maxWidth: 140,
              sampling: true,
              hover: true,
              label: {
                visible: true,
                flush: true,
                containerAlign: 'right',
                space: 0,
                style: {
                  maxLineWidth: 180,
                  fill: '#BCC1CB',
                  angle: 0,
                  fontSize: 12,
                  fontWeight: 400
                },
                minGap: 1,
                autoHide: false,
                autoHideMethod: 'greedy',
                autoHideSeparation: 1,
                autoLimit: false,
                autoRotate: false,
                autoRotateAngle: [0, -45, -90],
                lastVisible: true
              },
              title: {
                visible: true,
                text: 'order_date',
                style: {
                  fill: '#606773',
                  fontSize: 12,
                  fontWeight: 400
                }
              },
              tick: {
                visible: false,
                tickSize: 4,
                inside: false,
                style: {
                  stroke: '#21252C'
                }
              },
              grid: {
                visible: false,
                style: {
                  lineWidth: 1,
                  stroke: '#E3E5EB',
                  lineDash: [4, 2]
                }
              },
              domainLine: {
                visible: false
              },
              paddingInner: [0.15, 0.1],
              paddingOuter: [0.075, 0.1],
              innerOffset: {
                top: 2,
                bottom: 2
              }
            }
          ],
          label: {
            visible: false,
            style: {
              stroke: '#fff',
              fill: '#212121',
              fontSize: 12
            },
            smartInvert: false,
            overlap: {
              hideOnHit: true,
              clampForce: true
            }
          },
          tooltip: {
            style: {
              panel: {
                padding: 7,
                border: {
                  radius: 12,
                  width: 1,
                  color: '#e3e5e8'
                },
                backgroundColor: '#fff'
              },
              keyLabel: {
                lineHeight: 12,
                fontSize: 12,
                fontColor: '#606773'
              },
              valueLabel: {
                lineHeight: 12,
                fontSize: 12,
                fontColor: '#21252c',
                fontWeight: 'medium'
              },
              titleLabel: {
                fontSize: 12,
                lineHeight: 12,
                fontColor: '#21252c',
                fontWeight: 'bold'
              }
            },
            visible: true,
            mark: {
              title: {
                visible: false
              },
              content: [
                {
                  visible: true,
                  hasShape: true,
                  shapeType: 'rectRound'
                },
                {
                  visible: true,
                  hasShape: true,
                  shapeType: 'rectRound'
                },
                {
                  visible: true,
                  hasShape: true,
                  shapeType: 'rectRound'
                },
                {
                  visible: true,
                  hasShape: true,
                  shapeType: 'rectRound'
                }
              ]
            },
            dimension: {
              title: {
                visible: true
              },
              content: [
                {
                  visible: true,
                  shapeType: 'rectRound',
                  hasShape: true
                }
              ]
            }
          },
          bar: {
            style: {
              visible: true,
              fillOpacity: 1,
              lineWidth: 1
            },
            state: {
              hover: {
                fillOpacity: 0.6
              }
            }
          },
          crosshair: {
            yField: {
              visible: true,
              line: {
                type: 'rect',
                style: {
                  lineWidth: 0,
                  opacity: 0.2,
                  fill: '#3641594d'
                }
              },
              label: {
                visible: false,
                labelBackground: {
                  visible: true,
                  style: {
                    fill: '#364159'
                  }
                },
                style: {
                  fill: '#ffffff'
                }
              }
            }
          },
          markPoint: [],
          markLine: [],
          markArea: []
        },
        style: {
          padding: [1, 1, 0, 1]
        },
        headerStyle: {
          bgColor: 'red',
          padding: 20
        }
      }
    ],
    records: {
      yA_20251104185257_cc73: [
        {
          co_20251104185439_08d5: '东北',
          ro_20251104185427_c32d: '公司',
          xA_20251104185255_e482: '2016-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '东北',
            ro_20251104185427_c32d: '公司',
            xA_20251104185255_e482: '2016-01-01',
            yA_20251104185257_cc73: '310'
          },
          yA_20251104185257_cc73: '310',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '310',
          __Dim_Y__: '2016-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '东北',
          ro_20251104185427_c32d: '公司',
          xA_20251104185255_e482: '2017-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '东北',
            ro_20251104185427_c32d: '公司',
            xA_20251104185255_e482: '2017-01-01',
            yA_20251104185257_cc73: '442'
          },
          yA_20251104185257_cc73: '442',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '442',
          __Dim_Y__: '2017-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '东北',
          ro_20251104185427_c32d: '公司',
          xA_20251104185255_e482: '2018-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '东北',
            ro_20251104185427_c32d: '公司',
            xA_20251104185255_e482: '2018-01-01',
            yA_20251104185257_cc73: '501'
          },
          yA_20251104185257_cc73: '501',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '501',
          __Dim_Y__: '2018-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '东北',
          ro_20251104185427_c32d: '公司',
          xA_20251104185255_e482: '2019-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '东北',
            ro_20251104185427_c32d: '公司',
            xA_20251104185255_e482: '2019-01-01',
            yA_20251104185257_cc73: '734'
          },
          yA_20251104185257_cc73: '734',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '734',
          __Dim_Y__: '2019-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '东北',
          ro_20251104185427_c32d: '小型企业',
          xA_20251104185255_e482: '2016-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '东北',
            ro_20251104185427_c32d: '小型企业',
            xA_20251104185255_e482: '2016-01-01',
            yA_20251104185257_cc73: '285'
          },
          yA_20251104185257_cc73: '285',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '285',
          __Dim_Y__: '2016-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '东北',
          ro_20251104185427_c32d: '小型企业',
          xA_20251104185255_e482: '2017-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '东北',
            ro_20251104185427_c32d: '小型企业',
            xA_20251104185255_e482: '2017-01-01',
            yA_20251104185257_cc73: '257'
          },
          yA_20251104185257_cc73: '257',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '257',
          __Dim_Y__: '2017-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '东北',
          ro_20251104185427_c32d: '小型企业',
          xA_20251104185255_e482: '2018-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '东北',
            ro_20251104185427_c32d: '小型企业',
            xA_20251104185255_e482: '2018-01-01',
            yA_20251104185257_cc73: '294'
          },
          yA_20251104185257_cc73: '294',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '294',
          __Dim_Y__: '2018-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '东北',
          ro_20251104185427_c32d: '小型企业',
          xA_20251104185255_e482: '2019-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '东北',
            ro_20251104185427_c32d: '小型企业',
            xA_20251104185255_e482: '2019-01-01',
            yA_20251104185257_cc73: '394'
          },
          yA_20251104185257_cc73: '394',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '394',
          __Dim_Y__: '2019-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '东北',
          ro_20251104185427_c32d: '消费者',
          xA_20251104185255_e482: '2016-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '东北',
            ro_20251104185427_c32d: '消费者',
            xA_20251104185255_e482: '2016-01-01',
            yA_20251104185257_cc73: '512'
          },
          yA_20251104185257_cc73: '512',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '512',
          __Dim_Y__: '2016-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '东北',
          ro_20251104185427_c32d: '消费者',
          xA_20251104185255_e482: '2017-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '东北',
            ro_20251104185427_c32d: '消费者',
            xA_20251104185255_e482: '2017-01-01',
            yA_20251104185257_cc73: '518'
          },
          yA_20251104185257_cc73: '518',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '518',
          __Dim_Y__: '2017-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '东北',
          ro_20251104185427_c32d: '消费者',
          xA_20251104185255_e482: '2018-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '东北',
            ro_20251104185427_c32d: '消费者',
            xA_20251104185255_e482: '2018-01-01',
            yA_20251104185257_cc73: '940'
          },
          yA_20251104185257_cc73: '940',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '940',
          __Dim_Y__: '2018-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '东北',
          ro_20251104185427_c32d: '消费者',
          xA_20251104185255_e482: '2019-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '东北',
            ro_20251104185427_c32d: '消费者',
            xA_20251104185255_e482: '2019-01-01',
            yA_20251104185257_cc73: '1276'
          },
          yA_20251104185257_cc73: '1276',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '1276',
          __Dim_Y__: '2019-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '中南',
          ro_20251104185427_c32d: '公司',
          xA_20251104185255_e482: '2016-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '中南',
            ro_20251104185427_c32d: '公司',
            xA_20251104185255_e482: '2016-01-01',
            yA_20251104185257_cc73: '586'
          },
          yA_20251104185257_cc73: '586',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '586',
          __Dim_Y__: '2016-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '中南',
          ro_20251104185427_c32d: '公司',
          xA_20251104185255_e482: '2017-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '中南',
            ro_20251104185427_c32d: '公司',
            xA_20251104185255_e482: '2017-01-01',
            yA_20251104185257_cc73: '686'
          },
          yA_20251104185257_cc73: '686',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '686',
          __Dim_Y__: '2017-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '中南',
          ro_20251104185427_c32d: '公司',
          xA_20251104185255_e482: '2018-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '中南',
            ro_20251104185427_c32d: '公司',
            xA_20251104185255_e482: '2018-01-01',
            yA_20251104185257_cc73: '774'
          },
          yA_20251104185257_cc73: '774',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '774',
          __Dim_Y__: '2018-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '中南',
          ro_20251104185427_c32d: '公司',
          xA_20251104185255_e482: '2019-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '中南',
            ro_20251104185427_c32d: '公司',
            xA_20251104185255_e482: '2019-01-01',
            yA_20251104185257_cc73: '1052'
          },
          yA_20251104185257_cc73: '1052',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '1052',
          __Dim_Y__: '2019-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '中南',
          ro_20251104185427_c32d: '小型企业',
          xA_20251104185255_e482: '2016-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '中南',
            ro_20251104185427_c32d: '小型企业',
            xA_20251104185255_e482: '2016-01-01',
            yA_20251104185257_cc73: '297'
          },
          yA_20251104185257_cc73: '297',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '297',
          __Dim_Y__: '2016-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '中南',
          ro_20251104185427_c32d: '小型企业',
          xA_20251104185255_e482: '2017-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '中南',
            ro_20251104185427_c32d: '小型企业',
            xA_20251104185255_e482: '2017-01-01',
            yA_20251104185257_cc73: '445'
          },
          yA_20251104185257_cc73: '445',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '445',
          __Dim_Y__: '2017-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '中南',
          ro_20251104185427_c32d: '小型企业',
          xA_20251104185255_e482: '2018-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '中南',
            ro_20251104185427_c32d: '小型企业',
            xA_20251104185255_e482: '2018-01-01',
            yA_20251104185257_cc73: '486'
          },
          yA_20251104185257_cc73: '486',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '486',
          __Dim_Y__: '2018-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '中南',
          ro_20251104185427_c32d: '小型企业',
          xA_20251104185255_e482: '2019-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '中南',
            ro_20251104185427_c32d: '小型企业',
            xA_20251104185255_e482: '2019-01-01',
            yA_20251104185257_cc73: '505'
          },
          yA_20251104185257_cc73: '505',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '505',
          __Dim_Y__: '2019-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '中南',
          ro_20251104185427_c32d: '消费者',
          xA_20251104185255_e482: '2016-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '中南',
            ro_20251104185427_c32d: '消费者',
            xA_20251104185255_e482: '2016-01-01',
            yA_20251104185257_cc73: '772'
          },
          yA_20251104185257_cc73: '772',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '772',
          __Dim_Y__: '2016-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '中南',
          ro_20251104185427_c32d: '消费者',
          xA_20251104185255_e482: '2017-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '中南',
            ro_20251104185427_c32d: '消费者',
            xA_20251104185255_e482: '2017-01-01',
            yA_20251104185257_cc73: '1071'
          },
          yA_20251104185257_cc73: '1071',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '1071',
          __Dim_Y__: '2017-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '中南',
          ro_20251104185427_c32d: '消费者',
          xA_20251104185255_e482: '2018-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '中南',
            ro_20251104185427_c32d: '消费者',
            xA_20251104185255_e482: '2018-01-01',
            yA_20251104185257_cc73: '1183'
          },
          yA_20251104185257_cc73: '1183',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '1183',
          __Dim_Y__: '2018-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '中南',
          ro_20251104185427_c32d: '消费者',
          xA_20251104185255_e482: '2019-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '中南',
            ro_20251104185427_c32d: '消费者',
            xA_20251104185255_e482: '2019-01-01',
            yA_20251104185257_cc73: '1843'
          },
          yA_20251104185257_cc73: '1843',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '1843',
          __Dim_Y__: '2019-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '华东',
          ro_20251104185427_c32d: '公司',
          xA_20251104185255_e482: '2016-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '华东',
            ro_20251104185427_c32d: '公司',
            xA_20251104185255_e482: '2016-01-01',
            yA_20251104185257_cc73: '505'
          },
          yA_20251104185257_cc73: '505',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '505',
          __Dim_Y__: '2016-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '华东',
          ro_20251104185427_c32d: '公司',
          xA_20251104185255_e482: '2017-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '华东',
            ro_20251104185427_c32d: '公司',
            xA_20251104185255_e482: '2017-01-01',
            yA_20251104185257_cc73: '791'
          },
          yA_20251104185257_cc73: '791',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '791',
          __Dim_Y__: '2017-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '华东',
          ro_20251104185427_c32d: '公司',
          xA_20251104185255_e482: '2018-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '华东',
            ro_20251104185427_c32d: '公司',
            xA_20251104185255_e482: '2018-01-01',
            yA_20251104185257_cc73: '951'
          },
          yA_20251104185257_cc73: '951',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '951',
          __Dim_Y__: '2018-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '华东',
          ro_20251104185427_c32d: '公司',
          xA_20251104185255_e482: '2019-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '华东',
            ro_20251104185427_c32d: '公司',
            xA_20251104185255_e482: '2019-01-01',
            yA_20251104185257_cc73: '1097'
          },
          yA_20251104185257_cc73: '1097',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '1097',
          __Dim_Y__: '2019-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '华东',
          ro_20251104185427_c32d: '小型企业',
          xA_20251104185255_e482: '2016-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '华东',
            ro_20251104185427_c32d: '小型企业',
            xA_20251104185255_e482: '2016-01-01',
            yA_20251104185257_cc73: '320'
          },
          yA_20251104185257_cc73: '320',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '320',
          __Dim_Y__: '2016-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '华东',
          ro_20251104185427_c32d: '小型企业',
          xA_20251104185255_e482: '2017-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '华东',
            ro_20251104185427_c32d: '小型企业',
            xA_20251104185255_e482: '2017-01-01',
            yA_20251104185257_cc73: '451'
          },
          yA_20251104185257_cc73: '451',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '451',
          __Dim_Y__: '2017-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '华东',
          ro_20251104185427_c32d: '小型企业',
          xA_20251104185255_e482: '2018-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '华东',
            ro_20251104185427_c32d: '小型企业',
            xA_20251104185255_e482: '2018-01-01',
            yA_20251104185257_cc73: '590'
          },
          yA_20251104185257_cc73: '590',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '590',
          __Dim_Y__: '2018-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '华东',
          ro_20251104185427_c32d: '小型企业',
          xA_20251104185255_e482: '2019-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '华东',
            ro_20251104185427_c32d: '小型企业',
            xA_20251104185255_e482: '2019-01-01',
            yA_20251104185257_cc73: '770'
          },
          yA_20251104185257_cc73: '770',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '770',
          __Dim_Y__: '2019-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '华东',
          ro_20251104185427_c32d: '消费者',
          xA_20251104185255_e482: '2016-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '华东',
            ro_20251104185427_c32d: '消费者',
            xA_20251104185255_e482: '2016-01-01',
            yA_20251104185257_cc73: '1074'
          },
          yA_20251104185257_cc73: '1074',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '1074',
          __Dim_Y__: '2016-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '华东',
          ro_20251104185427_c32d: '消费者',
          xA_20251104185255_e482: '2017-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '华东',
            ro_20251104185427_c32d: '消费者',
            xA_20251104185255_e482: '2017-01-01',
            yA_20251104185257_cc73: '1229'
          },
          yA_20251104185257_cc73: '1229',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '1229',
          __Dim_Y__: '2017-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '华东',
          ro_20251104185427_c32d: '消费者',
          xA_20251104185255_e482: '2018-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '华东',
            ro_20251104185427_c32d: '消费者',
            xA_20251104185255_e482: '2018-01-01',
            yA_20251104185257_cc73: '1369'
          },
          yA_20251104185257_cc73: '1369',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '1369',
          __Dim_Y__: '2018-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '华东',
          ro_20251104185427_c32d: '消费者',
          xA_20251104185255_e482: '2019-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '华东',
            ro_20251104185427_c32d: '消费者',
            xA_20251104185255_e482: '2019-01-01',
            yA_20251104185257_cc73: '1894'
          },
          yA_20251104185257_cc73: '1894',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '1894',
          __Dim_Y__: '2019-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '华北',
          ro_20251104185427_c32d: '公司',
          xA_20251104185255_e482: '2016-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '华北',
            ro_20251104185427_c32d: '公司',
            xA_20251104185255_e482: '2016-01-01',
            yA_20251104185257_cc73: '379'
          },
          yA_20251104185257_cc73: '379',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '379',
          __Dim_Y__: '2016-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '华北',
          ro_20251104185427_c32d: '公司',
          xA_20251104185255_e482: '2017-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '华北',
            ro_20251104185427_c32d: '公司',
            xA_20251104185255_e482: '2017-01-01',
            yA_20251104185257_cc73: '187'
          },
          yA_20251104185257_cc73: '187',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '187',
          __Dim_Y__: '2017-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '华北',
          ro_20251104185427_c32d: '公司',
          xA_20251104185255_e482: '2018-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '华北',
            ro_20251104185427_c32d: '公司',
            xA_20251104185255_e482: '2018-01-01',
            yA_20251104185257_cc73: '323'
          },
          yA_20251104185257_cc73: '323',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '323',
          __Dim_Y__: '2018-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '华北',
          ro_20251104185427_c32d: '公司',
          xA_20251104185255_e482: '2019-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '华北',
            ro_20251104185427_c32d: '公司',
            xA_20251104185255_e482: '2019-01-01',
            yA_20251104185257_cc73: '596'
          },
          yA_20251104185257_cc73: '596',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '596',
          __Dim_Y__: '2019-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '华北',
          ro_20251104185427_c32d: '小型企业',
          xA_20251104185255_e482: '2016-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '华北',
            ro_20251104185427_c32d: '小型企业',
            xA_20251104185255_e482: '2016-01-01',
            yA_20251104185257_cc73: '237'
          },
          yA_20251104185257_cc73: '237',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '237',
          __Dim_Y__: '2016-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '华北',
          ro_20251104185427_c32d: '小型企业',
          xA_20251104185255_e482: '2017-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '华北',
            ro_20251104185427_c32d: '小型企业',
            xA_20251104185255_e482: '2017-01-01',
            yA_20251104185257_cc73: '157'
          },
          yA_20251104185257_cc73: '157',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '157',
          __Dim_Y__: '2017-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '华北',
          ro_20251104185427_c32d: '小型企业',
          xA_20251104185255_e482: '2018-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '华北',
            ro_20251104185427_c32d: '小型企业',
            xA_20251104185255_e482: '2018-01-01',
            yA_20251104185257_cc73: '266'
          },
          yA_20251104185257_cc73: '266',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '266',
          __Dim_Y__: '2018-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '华北',
          ro_20251104185427_c32d: '小型企业',
          xA_20251104185255_e482: '2019-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '华北',
            ro_20251104185427_c32d: '小型企业',
            xA_20251104185255_e482: '2019-01-01',
            yA_20251104185257_cc73: '327'
          },
          yA_20251104185257_cc73: '327',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '327',
          __Dim_Y__: '2019-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '华北',
          ro_20251104185427_c32d: '消费者',
          xA_20251104185255_e482: '2016-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '华北',
            ro_20251104185427_c32d: '消费者',
            xA_20251104185255_e482: '2016-01-01',
            yA_20251104185257_cc73: '424'
          },
          yA_20251104185257_cc73: '424',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '424',
          __Dim_Y__: '2016-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '华北',
          ro_20251104185427_c32d: '消费者',
          xA_20251104185255_e482: '2017-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '华北',
            ro_20251104185427_c32d: '消费者',
            xA_20251104185255_e482: '2017-01-01',
            yA_20251104185257_cc73: '505'
          },
          yA_20251104185257_cc73: '505',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '505',
          __Dim_Y__: '2017-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '华北',
          ro_20251104185427_c32d: '消费者',
          xA_20251104185255_e482: '2018-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '华北',
            ro_20251104185427_c32d: '消费者',
            xA_20251104185255_e482: '2018-01-01',
            yA_20251104185257_cc73: '828'
          },
          yA_20251104185257_cc73: '828',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '828',
          __Dim_Y__: '2018-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '华北',
          ro_20251104185427_c32d: '消费者',
          xA_20251104185255_e482: '2019-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '华北',
            ro_20251104185427_c32d: '消费者',
            xA_20251104185255_e482: '2019-01-01',
            yA_20251104185257_cc73: '917'
          },
          yA_20251104185257_cc73: '917',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '917',
          __Dim_Y__: '2019-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '西北',
          ro_20251104185427_c32d: '公司',
          xA_20251104185255_e482: '2016-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '西北',
            ro_20251104185427_c32d: '公司',
            xA_20251104185255_e482: '2016-01-01',
            yA_20251104185257_cc73: '156'
          },
          yA_20251104185257_cc73: '156',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '156',
          __Dim_Y__: '2016-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '西北',
          ro_20251104185427_c32d: '公司',
          xA_20251104185255_e482: '2017-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '西北',
            ro_20251104185427_c32d: '公司',
            xA_20251104185255_e482: '2017-01-01',
            yA_20251104185257_cc73: '93'
          },
          yA_20251104185257_cc73: '93',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '93',
          __Dim_Y__: '2017-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '西北',
          ro_20251104185427_c32d: '公司',
          xA_20251104185255_e482: '2018-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '西北',
            ro_20251104185427_c32d: '公司',
            xA_20251104185255_e482: '2018-01-01',
            yA_20251104185257_cc73: '96'
          },
          yA_20251104185257_cc73: '96',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '96',
          __Dim_Y__: '2018-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '西北',
          ro_20251104185427_c32d: '公司',
          xA_20251104185255_e482: '2019-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '西北',
            ro_20251104185427_c32d: '公司',
            xA_20251104185255_e482: '2019-01-01',
            yA_20251104185257_cc73: '203'
          },
          yA_20251104185257_cc73: '203',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '203',
          __Dim_Y__: '2019-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '西北',
          ro_20251104185427_c32d: '小型企业',
          xA_20251104185255_e482: '2016-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '西北',
            ro_20251104185427_c32d: '小型企业',
            xA_20251104185255_e482: '2016-01-01',
            yA_20251104185257_cc73: '31'
          },
          yA_20251104185257_cc73: '31',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '31',
          __Dim_Y__: '2016-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '西北',
          ro_20251104185427_c32d: '小型企业',
          xA_20251104185255_e482: '2017-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '西北',
            ro_20251104185427_c32d: '小型企业',
            xA_20251104185255_e482: '2017-01-01',
            yA_20251104185257_cc73: '44'
          },
          yA_20251104185257_cc73: '44',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '44',
          __Dim_Y__: '2017-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '西北',
          ro_20251104185427_c32d: '小型企业',
          xA_20251104185255_e482: '2018-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '西北',
            ro_20251104185427_c32d: '小型企业',
            xA_20251104185255_e482: '2018-01-01',
            yA_20251104185257_cc73: '82'
          },
          yA_20251104185257_cc73: '82',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '82',
          __Dim_Y__: '2018-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '西北',
          ro_20251104185427_c32d: '小型企业',
          xA_20251104185255_e482: '2019-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '西北',
            ro_20251104185427_c32d: '小型企业',
            xA_20251104185255_e482: '2019-01-01',
            yA_20251104185257_cc73: '66'
          },
          yA_20251104185257_cc73: '66',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '66',
          __Dim_Y__: '2019-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '西北',
          ro_20251104185427_c32d: '消费者',
          xA_20251104185255_e482: '2016-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '西北',
            ro_20251104185427_c32d: '消费者',
            xA_20251104185255_e482: '2016-01-01',
            yA_20251104185257_cc73: '248'
          },
          yA_20251104185257_cc73: '248',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '248',
          __Dim_Y__: '2016-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '西北',
          ro_20251104185427_c32d: '消费者',
          xA_20251104185255_e482: '2017-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '西北',
            ro_20251104185427_c32d: '消费者',
            xA_20251104185255_e482: '2017-01-01',
            yA_20251104185257_cc73: '192'
          },
          yA_20251104185257_cc73: '192',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '192',
          __Dim_Y__: '2017-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '西北',
          ro_20251104185427_c32d: '消费者',
          xA_20251104185255_e482: '2018-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '西北',
            ro_20251104185427_c32d: '消费者',
            xA_20251104185255_e482: '2018-01-01',
            yA_20251104185257_cc73: '267'
          },
          yA_20251104185257_cc73: '267',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '267',
          __Dim_Y__: '2018-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '西北',
          ro_20251104185427_c32d: '消费者',
          xA_20251104185255_e482: '2019-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '西北',
            ro_20251104185427_c32d: '消费者',
            xA_20251104185255_e482: '2019-01-01',
            yA_20251104185257_cc73: '307'
          },
          yA_20251104185257_cc73: '307',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '307',
          __Dim_Y__: '2019-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '西南',
          ro_20251104185427_c32d: '公司',
          xA_20251104185255_e482: '2016-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '西南',
            ro_20251104185427_c32d: '公司',
            xA_20251104185255_e482: '2016-01-01',
            yA_20251104185257_cc73: '198'
          },
          yA_20251104185257_cc73: '198',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '198',
          __Dim_Y__: '2016-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '西南',
          ro_20251104185427_c32d: '公司',
          xA_20251104185255_e482: '2017-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '西南',
            ro_20251104185427_c32d: '公司',
            xA_20251104185255_e482: '2017-01-01',
            yA_20251104185257_cc73: '401'
          },
          yA_20251104185257_cc73: '401',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '401',
          __Dim_Y__: '2017-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '西南',
          ro_20251104185427_c32d: '公司',
          xA_20251104185255_e482: '2018-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '西南',
            ro_20251104185427_c32d: '公司',
            xA_20251104185255_e482: '2018-01-01',
            yA_20251104185257_cc73: '236'
          },
          yA_20251104185257_cc73: '236',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '236',
          __Dim_Y__: '2018-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '西南',
          ro_20251104185427_c32d: '公司',
          xA_20251104185255_e482: '2019-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '西南',
            ro_20251104185427_c32d: '公司',
            xA_20251104185255_e482: '2019-01-01',
            yA_20251104185257_cc73: '284'
          },
          yA_20251104185257_cc73: '284',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '284',
          __Dim_Y__: '2019-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '西南',
          ro_20251104185427_c32d: '小型企业',
          xA_20251104185255_e482: '2016-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '西南',
            ro_20251104185427_c32d: '小型企业',
            xA_20251104185255_e482: '2016-01-01',
            yA_20251104185257_cc73: '75'
          },
          yA_20251104185257_cc73: '75',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '75',
          __Dim_Y__: '2016-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '西南',
          ro_20251104185427_c32d: '小型企业',
          xA_20251104185255_e482: '2017-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '西南',
            ro_20251104185427_c32d: '小型企业',
            xA_20251104185255_e482: '2017-01-01',
            yA_20251104185257_cc73: '144'
          },
          yA_20251104185257_cc73: '144',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '144',
          __Dim_Y__: '2017-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '西南',
          ro_20251104185427_c32d: '小型企业',
          xA_20251104185255_e482: '2018-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '西南',
            ro_20251104185427_c32d: '小型企业',
            xA_20251104185255_e482: '2018-01-01',
            yA_20251104185257_cc73: '122'
          },
          yA_20251104185257_cc73: '122',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '122',
          __Dim_Y__: '2018-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '西南',
          ro_20251104185427_c32d: '小型企业',
          xA_20251104185255_e482: '2019-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '西南',
            ro_20251104185427_c32d: '小型企业',
            xA_20251104185255_e482: '2019-01-01',
            yA_20251104185257_cc73: '135'
          },
          yA_20251104185257_cc73: '135',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '135',
          __Dim_Y__: '2019-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '西南',
          ro_20251104185427_c32d: '消费者',
          xA_20251104185255_e482: '2016-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '西南',
            ro_20251104185427_c32d: '消费者',
            xA_20251104185255_e482: '2016-01-01',
            yA_20251104185257_cc73: '301'
          },
          yA_20251104185257_cc73: '301',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '301',
          __Dim_Y__: '2016-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '西南',
          ro_20251104185427_c32d: '消费者',
          xA_20251104185255_e482: '2017-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '西南',
            ro_20251104185427_c32d: '消费者',
            xA_20251104185255_e482: '2017-01-01',
            yA_20251104185257_cc73: '399'
          },
          yA_20251104185257_cc73: '399',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '399',
          __Dim_Y__: '2017-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '西南',
          ro_20251104185427_c32d: '消费者',
          xA_20251104185255_e482: '2018-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '西南',
            ro_20251104185427_c32d: '消费者',
            xA_20251104185255_e482: '2018-01-01',
            yA_20251104185257_cc73: '593'
          },
          yA_20251104185257_cc73: '593',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '593',
          __Dim_Y__: '2018-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        },
        {
          co_20251104185439_08d5: '西南',
          ro_20251104185427_c32d: '消费者',
          xA_20251104185255_e482: '2019-01-01',
          __OriginalData__: {
            co_20251104185439_08d5: '西南',
            ro_20251104185427_c32d: '消费者',
            xA_20251104185255_e482: '2019-01-01',
            yA_20251104185257_cc73: '511'
          },
          yA_20251104185257_cc73: '511',
          __MeaId__: 'yA_20251104185257_cc73',
          __MeaName__: 'sum(amount)',
          __MeaValue__yA_20251104185257_cc73: '511',
          __Dim_Y__: '2019-01-01',
          __Dim_Color__: 'yA_20251104185257_cc73',
          __Dim_Detail__: 'yA_20251104185257_cc73',
          __Dim_ColorId__: 'yA_20251104185257_cc73'
        }
      ]
    },
    widthMode: 'standard',
    autoFillWidth: true,
    defaultHeaderColWidth: 'auto',
    defaultColWidth: 200,
    heightMode: 'standard',
    autoFillHeight: true,
    defaultRowHeight: 100,
    defaultHeaderRowHeight: 'auto',
    indicatorsAsCol: true,
    select: {
      highlightMode: 'cell',
      headerSelectMode: 'inline'
    },
    hover: {
      highlightMode: 'cross'
    },
    tooltip: {
      isShowOverflowTextTooltip: true
    },
    corner: {
      titleOnDimension: 'row'
    },
    animationAppear: {
      duration: 600,
      type: 'all',
      direction: 'row'
    },
    theme: {
      underlayBackgroundColor: 'rgba(0,0,0,0)',
      bodyStyle: {
        borderColor: '#e3e5eb',
        color: '#141414',
        bgColor: 'rgba(0,0,0,0)',
        hover: {
          cellBgColor: 'transparent'
        }
      },
      headerStyle: {
        borderColor: '#e3e5eb',
        fontSize: 12,
        color: '#21252c',
        textAlign: 'center',
        bgColor: 'transparent',
        hover: {
          cellBgColor: '#D9DDE4',
          inlineRowBgColor: '#D9DDE455',
          inlineColumnBgColor: '#D9DDE455'
        }
      },
      rowHeaderStyle: {
        borderColor: '#e3e5eb',
        fontSize: 12,
        color: '#21252c',
        padding: [0, 12, 0, 20],
        bgColor: 'transparent',
        hover: {
          cellBgColor: '#D9DDE4',
          inlineRowBgColor: '#D9DDE455',
          inlineColumnBgColor: '#D9DDE455'
        }
      },
      cornerHeaderStyle: {
        borderColor: '#e3e5eb',
        textAlign: 'center',
        fontSize: 12,
        color: '#21252c',
        padding: [0, 12, 0, 4],
        fontWeight: 'bold',
        borderLineWidth: [0, 1, 1, 0],
        bgColor: 'transparent',
        frameStyle: {
          borderColor: '#e3e5eb'
        },
        hover: {
          cellBgColor: '#D9DDE4',
          inlineRowBgColor: '#D9DDE455',
          inlineColumnBgColor: '#D9DDE455'
        }
      },
      cornerLeftBottomCellStyle: {
        borderColor: '#e3e5eb',
        borderLineWidth: [0, 0, 0, 0],
        bgColor: 'transparent',
        frameStyle: {
          borderColor: '#e3e5eb',
          borderLineWidth: [1, 0, 0, 0]
        },
        hover: {
          cellBgColor: '#D9DDE4'
        }
      },
      cornerRightTopCellStyle: {
        borderColor: '#e3e5eb',
        borderLineWidth: [0, 0, 1, 1],
        frameStyle: {
          borderColor: '#e3e5eb',
          borderLineWidth: 0
        },
        bgColor: 'transparent',
        hover: {
          cellBgColor: '#D9DDE4'
        }
      },
      rightFrozenStyle: {
        borderColor: '#e3e5eb',
        bgColor: 'transparent',
        frameStyle: {
          borderLineWidth: 0
        },
        hover: {
          borderLineWidth: 0,
          cellBgColor: '#D9DDE4'
        }
      },
      cornerRightBottomCellStyle: {
        borderColor: '#e3e5eb',
        bgColor: 'transparent',
        borderLineWidth: [1, 0, 0, 1],
        frameStyle: {
          borderColor: '#e3e5eb',
          borderLineWidth: [1, 0, 0, 1]
        },
        hover: {
          cellBgColor: '#D9DDE4'
        }
      },
      bottomFrozenStyle: {
        borderColor: '#e3e5eb',
        borderLineWidth: [1, 0, 0, 1],
        bgColor: 'transparent',
        hover: {
          cellBgColor: '#D9DDE4'
        }
      },
      selectionStyle: {
        cellBgColor: '',
        cellBorderColor: ''
      },
      frameStyle: {
        borderColor: '#e3e5eb',
        cornerRadius: 0,
        borderLineWidth: 0
      }
    },
    title: {
      text: 'area',
      align: 'center',
      orient: 'top',
      padding: [2, 0, 0, 0],
      textStyle: {
        fontSize: 12,
        fill: '#21252c',
        fontWeight: 'bold'
      }
    },
    legends: {
      padding: 0,
      visible: true,
      type: 'discrete',
      orient: 'top',
      position: 'end',
      maxCol: 1,
      maxRow: 1,
      data: [
        {
          label: 'yA_20251104185257_cc73',
          shape: {
            outerBorder: {
              stroke: '#7E5DFF',
              distance: 3,
              lineWidth: 1
            },
            fill: '#7E5DFF'
          }
        }
      ],
      item: {
        focus: true,
        maxWidth: '30%',
        focusIconStyle: {
          size: 14,
          fill: '#606773',
          fontWeight: 400
        },
        shape: {
          space: 6,
          style: {
            symbolType: 'rectRound',
            size: 8
          }
        },
        label: {
          style: {
            fontSize: 12,
            fill: '#606773',
            fontWeight: 400
          }
        },
        background: {
          state: {
            selectedHover: {
              fill: '#606773',
              fillOpacity: 0.05
            }
          }
        }
      }
    }
  };

  const tableInstance = new VTable.PivotChart(document.getElementById(CONTAINER_ID)!, option);
  tableInstance.onVChartEvent('click', args => {
    console.log('onVChartEvent click', args);
  });
  tableInstance.onVChartEvent('mouseover', args => {
    console.log('onVChartEvent mouseover', args);
  });
  const { LEGEND_ITEM_CLICK, LEGEND_ITEM_HOVER, LEGEND_ITEM_UNHOVER } = VTable.ListTable.EVENT_TYPE;
  tableInstance.on(LEGEND_ITEM_CLICK, args => {
    console.log('LEGEND_ITEM_CLICK', args);
    tableInstance.updateFilterRules([
      {
        filterKey: '20001',
        filteredValues: args.value
      }
    ]);
  });
  tableInstance.on(LEGEND_ITEM_HOVER, args => {
    console.log('LEGEND_ITEM_HOVER', args);
  });
  tableInstance.on(LEGEND_ITEM_UNHOVER, args => {
    console.log('LEGEND_ITEM_UNHOVER', args);
  });

  // setTimeout(() => {
  //   const datum = {
  //     '10001': '数量',
  //     '10002': '111',
  //     '10003': '230713183656009',
  //     '20001': '公司-数量',
  //     '230417170554008': '配件',
  //     '230417170554012': '一级',
  //     '230417171050028': '技术',
  //     '230417171050031': '中国',
  //     '230713183656009': '111',
  //     '230717170834024': '公司'
  //   };
  //   const cellAddr = {
  //     colHeaderPaths: [
  //       {
  //         dimensionKey: '230417171050031',
  //         value: '中国'
  //       },
  //       {
  //         dimensionKey: '230417171050028',
  //         value: '技术'
  //       }
  //     ],
  //     rowHeaderPaths: [
  //       {
  //         dimensionKey: '230417170554012',
  //         value: '一级'
  //       },
  //       {
  //         indicatorKey: '230713183656009',
  //         value: '数量'
  //       }
  //     ]
  //   };
  //   const position = tableInstance.getChartDatumPosition(datum, cellAddr);
  //   console.log('getChartDatumPosition', position);
  // }, 3000);
  window.tableInstance = tableInstance;

  // bindDebugTool(tableInstance.scenegraph.stage, {});
}
